app/Controllers/CitaController.php

SELECT *
FROM `servicios`
---
    public function Listar_Citas_Star()
    { //ok
        $servicio = new ServicioModel();
        $lista_de_citas = $this->model->CitasDetalle()->findAll();
        $lista_servicios = $servicio->findAll();