app/Controllers/TravelerController.php

    public function Get(){//ok

        $servicios = $this->servicioModel->findAll();
---
SELECT *
FROM `servicios`